1cServIntTestExt/src/src/InformationRegisters/ТМС_ВходящиеСообщения/ТМС_ВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТМС_ВходящиеСообщения</name>
  <resources>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУстаревания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КодОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщенияЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерТела</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УниверсальнаяДатаВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1cServIntTestExt/src/src/IntegrationServices/ТМС_mockService/Module.bsl
#Область ОбработчикиСобытий

Процедура e1c_ТестовыйПроект_Основной_OfficeToShop_e2eInQueueОбработкаПолученияСообщения(Сообщение, Отказ)
	
	РазмерСообщения = Сообщение.РазмерТела;
	
	МассивПараметров = Новый Массив;
	
	Для Каждого Параметр Из Сообщение.Параметры Цикл
		МассивПараметров.Добавить(Параметр.Ключ + "=" + Строка(Параметр.Значение));
	КонецЦикла;
	
	ПараметрыСтрокой = "";
	ПараметрыСтрокой = СтрСоединить(МассивПараметров, "; ");
	
	Тело = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерСообщения);
	
	Поток = Сообщение.ПолучитьТелоКакПоток();
	
	Пока Истина Цикл
		Прочитано = Поток.Прочитать(Буфер, 0, РазмерСообщения);
		
		Если Прочитано > 0 Тогда
			Тело = Тело.Соединить(Буфер);
		КонецЕсли;
		
		Если Прочитано < РазмерСообщения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ТелоСтрокой = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
		
		ИдентификаторСообщения = Сообщение.Идентификатор;
		
		НаборЗаписей = РегистрыСведений.ТМС_ВходящиеСообщения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения); 
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИдентификаторСообщения = ИдентификаторСообщения;
		НоваяЗапись.ИдентификаторСообщенияЗапроса = XMLСтрока(Сообщение.ИдентификаторСообщенияЗапроса);
		НоваяЗапись.Дата = ТекущаяДатаСеанса();
		НоваяЗапись.ДатаОтправки = Сообщение.ДатаОтправки;
		НоваяЗапись.Тело = ТелоСтрокой;
		НоваяЗапись.ДатаУстаревания = Сообщение.ДатаУстаревания;
		НоваяЗапись.КодОтправителя = Сообщение.КодОтправителя;
		НоваяЗапись.КодПолучателя = Сообщение.КодПолучателя;
		НоваяЗапись.РазмерТела = Сообщение.РазмерТела;
		НоваяЗапись.ИдентификаторГруппы = Сообщение.Параметры.Получить("ИдентификаторГруппы");
		НоваяЗапись.Параметры = ПараметрыСтрокой;
		НоваяЗапись.УниверсальнаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		НаборЗаписей.Записать();
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
